%:- if(current_predicate(js_script/2)).


мм_розбито_на_прості(Запит, СписокПростих) :-
    мм_ключ(Ключ), Promise := split(Запит, Ключ),
    catch(await(Promise, Vidpovidj), _, fail),
    maplist(dict_dija, Vidpovidj.chastyny, СписокПростих).

dict_dija(Dict, Dict.dija).


мм_беззмістовне_питання(Частина, Запит) :-
    мм_ключ(Ключ),
    Promise := is_actionless(Частина, Запит, Ключ),
    catch(await(Promise, D), _, fail),
    D.is_real_action < 30.


мм_підходяща(СловаКоманди-Оцінка, Запит) :-
    мм_ключ(Ключ),
    Promise := guess(Запит, Ключ),
    catch(await(Promise, Vidpovidj), _, fail),
    member(Варіант, Vidpovidj), Варіант.ocinka > 75,
    % Вгадування завжди гірше за підбір команд, бо може дати гравцеві
    % приклад некоректної команди
    Оцінка is Варіант.ocinka - 100,
    розбити_на_слова(Варіант.komanda, СловаКоманди).
мм_підходяща(СловаКоманди-Оцінка, Запит) :-
    мм_задума, flush_output,
    найкращі_команди(3, [[…]], СловаКомандОцінки,
		     1->4, мм_ранжовані(Запит)),
    member(СловаКоманди-Оцінка, СловаКомандОцінки), Оцінка > 75.


мм_ранжовані(Запит, СловаКоманд, КомандиОцінки) :-
    застосувати_частково(неповна_команда, СловаКоманд, Неповні, Повні),
    мм_ранжовані_неповні(Запит, Неповні, КомандиОцінкиНеповні),
    мм_ранжовані_повні(Запит, Повні, КомандиОцінкиПовні),
    нуегм, flush_output,
    append(КомандиОцінкиНеповні, КомандиОцінкиПовні, КомандиОцінки).

мм_ранжовані_неповні(_Запит, [], []).
мм_ранжовані_неповні(Запит, СловаКоманд, КомандиОцінки) :-
    мм_ключ(Ключ),
    maplist(слова_стринг, СловаКоманд, СтрКоманд),
    Promise := choose_and_complete(Запит, СтрКоманд, Ключ),
    catch(await(Promise, Vidpovidj), _, fail),
    maplist(dict_variant_pair_noncomplete, Vidpovidj, КомандиОцінки).
% TODO: Звернути увагу на вже доповнені команди. Вони вже можуть сприйматися
% парсером.

dict_variant_pair_noncomplete(Dict, СловаКомандиТриКрапки-Dict.ocinka) :-
    розбити_на_слова(Dict.komanda, СловаКоманди),
    append(СловаКоманди, […], СловаКомандиТриКрапки).

мм_ранжовані_повні(_Запит, [], []).
мм_ранжовані_повні(Запит, СловаКоманд, КомандиОцінки) :-
    мм_ключ(Ключ),
    maplist(слова_стринг, СловаКоманд, СтрКоманд),
    length(СловаКоманд, N),
    (N < 6
     -> Promise := rank(Запит, СтрКоманд, Ключ)
     ;  Promise := choose(Запит, СтрКоманд, Ключ)),
    catch(await(Promise, Vidpovidj), _, fail),
    maplist(dict_variant_pair, Vidpovidj, КомандиОцінки).

dict_variant_pair(Dict, СловаКоманди-Dict.ocinka) :-
    розбити_на_слова(Dict.komanda, СловаКоманди).

слова_стринг(Слова, Стр) :- atomic_list_concat(Слова, " ", Стр).

%:- endif.
